In [1]:
import datetime
from datetime import datetime, date
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from IPython.display import Image
#
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 10)
pd.set_option('display.width', 250)
#
%matplotlib inline

In [2]:
dates = pd.date_range('2019-01-01', '2019-01-06')
temps1 = pd.Series([80,82,85,90,83,87], index= dates)

In [3]:
temps2 = pd.Series([70, 75,69,83, 79,77], index = dates)
temps_diffs = temps1 - temps2
temps_diffs

2019-01-01    10
2019-01-02     7
2019-01-03    16
2019-01-04     7
2019-01-05     4
2019-01-06    10
Freq: D, dtype: int64

In [4]:
temps_diffs.mean()

9.0

In [5]:
temps_df = pd.DataFrame(
    {
        'Missoula' : temps1,
        'Philadelphia' : temps2
    }
)
temps_df

            Missoula  Philadelphia
2019-01-01        80            70
2019-01-02        82            75
2019-01-03        85            69
2019-01-04        90            83
2019-01-05        83            79
2019-01-06        87            77

In [6]:
temps_df['Missoula']

2019-01-01    80
2019-01-02    82
2019-01-03    85
2019-01-04    90
2019-01-05    83
2019-01-06    87
Freq: D, Name: Missoula, dtype: int64

In [7]:
temps_df[['Philadelphia','Missoula']]

            Philadelphia  Missoula
2019-01-01            70        80
2019-01-02            75        82
2019-01-03            69        85
2019-01-04            83        90
2019-01-05            79        83
2019-01-06            77        87

In [8]:
temps3 = pd.Series([75, 77, 67, 82, 77, 85], index=dates)
temps_df2 = pd.DataFrame(
        {
        'Missoula': temps1,
        'Philadelphia': temps2,
        'Seoul': temps3,
        }
)
#temps_df2  # 출력부분을 임시로 주석함

In [9]:
print('Missoula \t평균기온 : {0:.2f}'.format(temps1.mean()))   # {} 서식문자를 사용한 부분을 기억하세요.
print('Philadelphia \t평균기온 : {0:.2f}'.format(temps2.mean())) 
print('Seoul \t\t평균기온 : {0:.2f}'.format(temps3.mean()))

Missoula 	평균기온 : 84.50
Philadelphia 	평균기온 : 75.50
Seoul 		평균기온 : 77.17

In [10]:
round(temps_df2.mean(),2)  # 반올림 함수를 함 사용함

Missoula        84.50
Philadelphia    75.50
Seoul           77.17
dtype: float64

In [11]:
temps_df.Missoula

2019-01-01    80
2019-01-02    82
2019-01-03    85
2019-01-04    90
2019-01-05    83
2019-01-06    87
Freq: D, Name: Missoula, dtype: int64

In [12]:
temps_diff = temps_df.Missoula - temps_df.Philadelphia
temps_diff

2019-01-01    10
2019-01-02     7
2019-01-03    16
2019-01-04     7
2019-01-05     4
2019-01-06    10
Freq: D, dtype: int64

In [13]:
temps_df.columns

Index(['Missoula', 'Philadelphia'], dtype='object')

In [14]:
temps_df['Difference'] = temps_diffs
temps_df

            Missoula  Philadelphia  Difference
2019-01-01        80            70          10
2019-01-02        82            75           7
2019-01-03        85            69          16
2019-01-04        90            83           7
2019-01-05        83            79           4
2019-01-06        87            77          10

In [15]:
temps_df.columns

Index(['Missoula', 'Philadelphia', 'Difference'], dtype='object')

In [16]:
temps_df.Difference[1:4]

2019-01-02     7
2019-01-03    16
2019-01-04     7
Freq: D, Name: Difference, dtype: int64

In [17]:
temps_df.iloc[1]  # 1번째 로우의 데이터를 참조함 단, 맨 처음로우는 0임

Missoula        82
Philadelphia    75
Difference       7
Name: 2019-01-02 00:00:00, dtype: int64

In [18]:
temps_df.iloc[1].index

Index(['Missoula', 'Philadelphia', 'Difference'], dtype='object')

In [19]:
temps_df.loc['2019-01-05'] # loc함수는 인덱스 레이블(컬럼값)에
    #해당하는 로우 값을 참조한다.

Missoula        83
Philadelphia    79
Difference       4
Name: 2019-01-05 00:00:00, dtype: int64

In [20]:
temps_df.iloc[[1, 3, 5]]

            Missoula  Philadelphia  Difference
2019-01-02        82            75           7
2019-01-04        90            83           7
2019-01-06        87            77          10

In [21]:
temps_df.Missoula > 82

2019-01-01    False
2019-01-02    False
2019-01-03     True
2019-01-04     True
2019-01-05     True
2019-01-06     True
Freq: D, Name: Missoula, dtype: bool

In [22]:
temps_df[temps_df.Missoula > 82]

            Missoula  Philadelphia  Difference
2019-01-03        85            69          16
2019-01-04        90            83           7
2019-01-05        83            79           4
2019-01-06        87            77          10

In [23]:
temps_df['Seoul'] = temps3
temps_df

            Missoula  Philadelphia  Difference  Seoul
2019-01-01        80            70          10     75
2019-01-02        82            75           7     77
2019-01-03        85            69          16     67
2019-01-04        90            83           7     82
2019-01-05        83            79           4     77
2019-01-06        87            77          10     85

# 28일차 강의 시작

In [ ]:
%pfile data/goog.csv

In [25]:
df = pd.read_csv('data/goog.csv') # ipynb 파일이 존재하는 디렉터리의 하위디렉터리인
   # data 디렉터리에 존재하는 goog.csv파일을 오픈하겠다는 의미입니다 
df

          Date        Open        High         Low       Close   Volume
0   12/19/2016  790.219971  797.659973  786.270020  794.200012  1225900
1   12/20/2016  796.760010  798.650024  793.270020  796.419983   925100
2   12/21/2016  795.840027  796.676025  787.099976  794.559998  1208700
3   12/22/2016  792.359985  793.320007  788.580017  791.260010   969100
4   12/23/2016  790.900024  792.739990  787.280029  789.909973   623400
..         ...         ...         ...         ...         ...      ...
56   3/13/2017  844.000000  848.684998  843.250000  845.539978  1149500
57   3/14/2017  843.640015  847.239990  840.799988  845.619995   779900
58   3/15/2017  847.590027  848.630005  840.770020  847.200012  1379600
59   3/16/2017  849.030029  850.849976  846.130005  848.780029   970400
60   3/17/2017  851.609985  853.400024  847.109985  852.119995  1712300

[61 rows x 6 columns]

In [26]:
df.Date

0     12/19/2016
1     12/20/2016
2     12/21/2016
3     12/22/2016
4     12/23/2016
         ...
56     3/13/2017
57     3/14/2017
58     3/15/2017
59     3/16/2017
60     3/17/2017
Name: Date, Length: 61, dtype: object

In [27]:
df.Open

0     790.219971
1     796.760010
2     795.840027
3     792.359985
4     790.900024
         ...
56    844.000000
57    843.640015
58    847.590027
59    849.030029
60    851.609985
Name: Open, Length: 61, dtype: float64

In [30]:
df3 = df.iloc[0:3]
df3

         Date        Open        High         Low       Close   Volume
0  12/19/2016  790.219971  797.659973  786.270020  794.200012  1225900
1  12/20/2016  796.760010  798.650024  793.270020  796.419983   925100
2  12/21/2016  795.840027  796.676025  787.099976  794.559998  1208700

In [35]:
df3 = df.iloc[0:3,4:]
df3

        Close   Volume
0  794.200012  1225900
1  796.419983   925100
2  794.559998  1208700

In [36]:
df4 = df.iloc[0:3,3:5]
df4

          Low       Close
0  786.270020  794.200012
1  793.270020  796.419983
2  787.099976  794.559998

In [37]:
df5 = df.iloc[1:61:2]
df5

          Date        Open        High         Low       Close   Volume
1   12/20/2016  796.760010  798.650024  793.270020  796.419983   925100
3   12/22/2016  792.359985  793.320007  788.580017  791.260010   969100
5   12/27/2016  790.679993  797.859985  787.656982  791.549988   789100
7   12/29/2016  783.330017  785.929993  778.919983  782.789978   742200
9     1/3/2017  778.809998  789.630005  775.799988  786.140015  1643100
..         ...         ...         ...         ...         ...      ...
51    3/6/2017  826.950012  828.880005  822.400024  827.780029  1105800
53    3/8/2017  833.510010  838.150024  831.789978  835.369995   988700
55   3/10/2017  843.280029  844.909973  839.500000  843.250000  1701100
57   3/14/2017  843.640015  847.239990  840.799988  845.619995   779900
59   3/16/2017  849.030029  850.849976  846.130005  848.780029   970400

[30 rows x 6 columns]

### 실습-1.  
df에 있는 자료 중에서 홀수의 행만을 출력하는 코드를 작성하세요.  
df.iloc[1,3,5,7,9,11,13,15,17, ... ,:] 과 같은 코드는 안됩니다.